<?php
$msg = array(
    //系统级别
	400  => '签名错误',
	401  => '签名验证失败', 
	402  => 'appId不能为空',
	403  => 'signValue不能为空',
    404  => '用户id不能为空',
    405  => '设备id不能为空',
	
	
	1001 => '操作成功',
	1002 => '操作失败',
	1003 => '参数不能为空',
    1004 => '参数非法',
	
	//课时
	2001 => '课时Id不能为空',
	2002 => '暂无该课时',
	2003 => '',
	
	//签到
	200 => '参数不能为空',
	201 => '用户不存在',
	202 => '今天没有该课！',
	203 => '请在开课当天打卡',
	204 => '未到签到时间',
	205 => '上课期间不能打卡',
	206 => '已过签到时间',
	207 => '您已签到',
	208 => '您已签退',
	209 => '打卡失败',
    210 => '用户不在该班级',
	214 => '签退成功',
	215 => '打卡成功',
    
    //评论
    301 => '评论成功',
    302 => '评论失败',
    303 => '评论内容不能为空',
    304 => '评级非法',
    305 => '您已评论',
    
    //报名
    500 => '报名成功',
    501 => '暂无班级信息',
    502 => '班级id不能为空',
    503 => '该班暂无课程',
    504 => '您已经是该班级学员',
    505 => '您已报名',
    506 => '报名失败',
    507 => '获取订单接口数据失败',
    508 => '您还未报名该班级',
    509 => '您还未付报名费',
    510 => '您的订单已取消',
    511 => '您的订单未通过审核',
    512 => '您的订单还未被审核',
    513 => '请不要重复报到',
    514 => '报到失败',
    515 => '报到成功',
    516 => '您不是创客以上会员',
    517 => '您没有身份证认证',
    518 => '你的上课机会已转让',
    
    601 => '您还没报任何班级',
    602 => '暂无班级信息',
    603 => '请输入关键字',
    604 => '课程id不能为空',
    
);
