<?php

$msg = array(
    '0001' => '登录系统成功！',
    '0002' => '请检查密码是否正确',
    '0003' => '此用户账号已经被禁止登录，请联系管理员。',
    '0004' => '您还没有登录，请先登录。',
    '0005' => '您没有操作记录的权限，也可能是目前状态下，此记录不可操作。',
    '0006' => '您的身份不对，无法进入此系统。',
    '0007' => '需要提交令牌校验，请不要重复提交，刷新后再试。',

    /* adadsa */
    '1001' => '操作成功!', //广义上的返回成功,获取数据,执行操作等等
    '1002' => '操作失败!', //广义上的返回失败,获取数据,执行操作等等
    /* 用户登录部分 */
	'2001' => '验证码错误',
    
    
    '2009' => '手机验证码错误',
    
    '2100' => '登录成功',
    '2113' => '权限被篡改，联系管理员',
    '2101' => '您的帐号是员工帐号，请到员工登录中心登录。',
    '2110' => '员工账号格式不对。',
    '2105' => '密码错误。',
    '2112' => '限制IP登录，请联系网管。',
    '2199' => '账号或密码错误',
    '2102' => '账号不存在。',
    '2103' => '此账号停止使用，请联系管理员',
    '2108' => '您已退会，无法登录。',
    '2109' => '您的账号用户名不符合新系统规范，点击确定重置用户名。',
    
    '2111' => '您的账号用户名不符合系统规范，请重新填写用户名。',
    '4001' => '输入密码不一致',
    '2002' => '用户名已被占用',
    '2003' => '密码长度不够，需要8-20位，',
    '2004' => '手机号码已被占用',
    '2005' => '推荐人错误',
    '2006' => '身份证号码已被占用',
    
    '3001' => '操作成功',
    /* 用户登录部分end */

    /* 相关账户字词替换 */
    'accountType1' => '预存款账户',
    'accountType2' => '交易账户',
    'accountType3' => '创业账户',
    'accountType33' => '创业',
    'accountType4' => '服务费账户',
    'accountType44' => '服务费',
    'accountType5' => '白积分账户',
    'accountType6' => '红积分账户',
    'accountType7' => '预存款账户'
);
?>
