<?php

$msg = array(
    '0001' => '登录系统成功！',
    '0002' => '请检查密码是否正确',
    '0003' => '此用户账号已经被禁止登录，请联系管理员。',
    '0004' => '您还没有登录，请先登录。',
    '0005' => '您没有操作记录的权限，也可能是目前状态下，此记录不可操作。',
    '0006' => '您的身份不对，无法进入此系统。',
    '0007' => '需要提交令牌校验，请不要重复提交，刷新后再试。',
    /* adadsa */
    '1001' => '操作成功!', //广义上的返回成功,获取数据,执行操作等等
    '1002' => '操作失败!', //广义上的返回失败,获取数据,执行操作等等

    /* 用户注册部分 */
    '2000' => '注册成功',
    '2001' => '验证码错误',
    '2002' => '用户名已被占用',
    '2003' => '密码格式错误',
    '2004' => '手机已被占用',
    '2005' => '推荐人错误',
    '2006' => '身份证已被占用',
    '2007' => '公司名称已被占用',
    '2008' => '营业执照已被占用',
    '2009' => '手机验证码错误',
    '2010' => '税务登记证占用',
    '2099' => '注册失败',
    /* 用户注册部分end */


    /* 用户登录部分 */
    '2100' => '登录成功',
    '2113' => '权限被篡改，联系管理员',
    '2101' => '您的帐号是员工帐号，请到员工登录中心登录。',
    '2110' => '员工账号格式不对。',
    '2105' => '密码错误。',
    '2112' => '限制IP登录，请联系网管。',
    '2199' => '登录失败',
    '2102' => '账号不存在。',
    '2103' => '此账号停止使用，请联系管理员',
    /* 用户登录部分end */

    /* 权限分组部分 */
    '2200' => '操作成功',
    '2299' => '操作失败',
        /* 权限分组部分end */



    /* 新闻发布部分 */
    '3000' => '添加信息成功',
    '3001' => '添加信息失败',
    '3002' => '新闻标题不能为空',
    '3003' => '新闻内容不能为空',
    '3004' => '删除成功',
    '3005' => '信息删除失败',
    '3006' => '请选择新闻版块',
    '3007' => '更新成功',
    '3008' => '更新失败',
    '3009' => '表单参数错误',
    '3010' => '操作成功',
    '3011' => '操作失败',
    '3012' => '参数错误',
    '3013' => '记录为空',
    '3014' => '概要字数超过100',
    '3015' => '重复提交',

        /* adadsa end */
    '4000' => '添加活动成功',
    '4001' => '参数错误',
    '4002' => '目标款错误',
    '4003' => '活动时间错误',
    '4004' => '付款账号错误',
    '4005' => '现金账户账号不存在',
    '4006' => '活动标题错误',
    '4007' => '活动类型错误',
    '4008' => '活动内容错误',
    '4009' => '活动内容错误',
    '4010' => '图片上传错误',

    '505'  => '操作金额过大，请联系主管',

    /* 相关账户字词替换 */
    'accountType1' => '现金账户',
    'accountType2' => '交易账户',
    'accountType3' => '创业账户',
    'accountType33' => '创业',
    'accountType4' => '服务费账户',
    'accountType44' => '服务费',
    'accountType5' => '白积分账户',
    'accountType6' => '红积分账户',
    'accountType7' => '预存款账户',
	
	 /* 商学院课程 */
	'4011' => '课程名不能为空',
	'4012' => '课程内容不能为空',
	'4013' => '课程添加成功',
	'4014' => '课程添加失败',
	'4015' => '课程更新成功',
	'4016' => '课程更新失败',
	'4017' => '请输入课程id',
	'4018' => '课程不存在',
	'4019' => '课程删除失败',
	'4020' => '课程删除成功',
	'4021' => 'id不能为空',
	
	
	
);
?>
